sicp-exercises.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-10 Sun 23:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP Exercises</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Tanner Hoelzel" />
</head>
<body>
<div id="content">
<h1 class="title">SICP Exercises</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5345cd3">Chapter 1</a></li>
<li><a href="#orge9f41a1">Chapter 2</a></li>
</ul>
</div>
</div>
<div id="outline-container-org5345cd3" class="outline-2">
<h2 id="org5345cd3">Chapter 1</h2>
<div class="outline-text-2" id="text-org5345cd3">
</div>
<div id="outline-container-org9071ccc" class="outline-3">
<h3 id="org9071ccc">Exercise 1.3</h3>
<div class="outline-text-3" id="text-org9071ccc">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">square</span> x)
(* x x))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">sum-of-squares-of-largest</span> a b c)
  (- (+ (square a) (square b) (square c))
     (<span style="color: #a020f0;">cond</span> ((<span style="color: #a020f0;">and</span> (&lt; a b) (&lt; a c)) a)
           ((&lt; b c) b)
           (<span style="color: #a020f0;">else</span> c))))
</pre>
</div>
<p>
A recursive procedure is simply one that calls itself by name. It is
not necessarily a recursive process.
</p>

<p>
“Programs must be written for people to read, and only incidentally
for computers to execute”
</p>
</div>
</div>
<div id="outline-container-org5472a66" class="outline-3">
<h3 id="org5472a66">Exercise 1.6</h3>
<div class="outline-text-3" id="text-org5472a66">
<p>
Enters a recursive loop not because a cond structure is used instead
of an if structure but because a function is called instead of using
an if (or cond) structure. If new-if were implemented with if instead
of cond, the code would also enter an infinite loop.
</p>

<p>
“The set of expressions for which a binding defines a name is called
the scope of that name”
</p>
</div>
</div>
<div id="outline-container-orgf77e31b" class="outline-3">
<h3 id="orgf77e31b">Exercise 1.9</h3>
<div class="outline-text-3" id="text-orgf77e31b">
<p>
First (recursive)
</p>

<p>
(+ 4 5)
</p>

<p>
(inc (+ (dec 4) 5))
</p>

<p>
(inc (+ 3 5))
</p>

<p>
(inc (inc (+ (dec 3) 5)))
</p>

<p>
(inc (inc (+ 2 5)))
</p>

<p>
(inc (inc (inc (+ (dec 2) 5))))
</p>

<p>
(inc (inc (inc (+ 1 5))))
</p>

<p>
(inc (inc (inc (inc (+ (dec 1) 5)))))
</p>

<p>
(inc (inc (inc (inc (+ 0 5)))))
</p>

<p>
(inc (inc (inc (inc 5))))
</p>

<p>
(inc (inc (inc 6)))
</p>

<p>
(inc (inc 7))
</p>

<p>
(inc 8)
</p>

<p>
9
</p>

<p>
Second (iterative)
</p>

<p>
(+ 4 5)
</p>

<p>
(+ (dec 4) (inc 5))
</p>

<p>
(+ 3 6)
</p>

<p>
(+ (dec 3) (inc 6))
</p>

<p>
(+ 2 7)
</p>

<p>
(+ (dec 2) (inc 7))
</p>

<p>
(+ 1 8)
</p>

<p>
(+ (dec 1) (inc 8))
</p>

<p>
(+ 0 9)
</p>

<p>
9
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">my-count-change</span> amt values)
  (<span style="color: #a020f0;">cond</span> ((null? values) 0)
        ((&lt; amt 0) 0)
        ((= amt 0) 1)
        (<span style="color: #a020f0;">else</span> (+ (my-count-change (- amt (car values)) values)
                 (my-count-change amt (cdr values))))))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">count-change</span> amt)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">cc</span> amount kinds-of-coins)
    (<span style="color: #a020f0;">cond</span> ((= amount 0) 1)
          ((<span style="color: #a020f0;">or</span> (&lt; amount 0) (= kinds-of-coins 0)) 0)
          (<span style="color: #a020f0;">else</span> (+ (cc amount
                       (- kinds-of-coins 1))
                   (cc (- amount
                          (first-denomination kinds-of-coins))
                       kinds-of-coins)))))
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">first-denomination</span> kinds-of-coins)
    (<span style="color: #a020f0;">cond</span> ((= kinds-of-coins 1) 1)
          ((= kinds-of-coins 2) 5)
          ((= kinds-of-coins 3) 10)
          ((= kinds-of-coins 4) 25)
          ((= kinds-of-coins 5) 50)))
  (cc amt 5))
</pre>
</div>
</div>
</div>
<div id="outline-container-org1016dcd" class="outline-3">
<h3 id="org1016dcd">Exercise 1.11</h3>
<div class="outline-text-3" id="text-org1016dcd">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">f</span> n)
  (<span style="color: #a020f0;">if</span> (&lt; n 3)
      n
      (+ (* 1 (f (- n 1)))
         (* 2 (f (- n 2)))
         (* 3 (f (- n 3))))))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">f-iter</span> n)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">iterate</span> a b c count)
    (<span style="color: #a020f0;">if</span> (= count 0)
        a
        (iterate b
                c
                (+ c
                   (* b 2)
                   (* a 3))
                (- count 1))))
  (iterate 0 1 2 n))
</pre>
</div>
</div>
</div>
<div id="outline-container-org05b8b79" class="outline-3">
<h3 id="org05b8b79">Exercise 1.12</h3>
<div class="outline-text-3" id="text-org05b8b79">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">pascal</span> n m)
  (<span style="color: #a020f0;">if</span> (<span style="color: #a020f0;">or</span> (= m 0)
          (= m n))
      1
      (+ (pascal (- n 1) (- m 1))
         (pascal (- n 1) m))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf7298ea" class="outline-3">
<h3 id="orgf7298ea">Exercise 1.16</h3>
<div class="outline-text-3" id="text-orgf7298ea">
<p>
If n even
</p>

<p>
b -&gt; b2
</p>

<p>
n -&gt; n/2 - 1
</p>

<p>
c -&gt; cb2
</p>

<p>
If n odd
</p>

<p>
b -&gt; b
</p>

<p>
n -&gt; n - 1
</p>

<p>
c -&gt; cb
</p>

<p>
Fibonacci numbers can be computed logarithmically too!
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">fast-expt</span> base exp)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">fast-iter</span> b n c)
    (<span style="color: #a020f0;">cond</span> ((= n 0) c)
          ((even? n) (fast-iter (* b b) (- (/ n 2) 1) (* c (* b b))))
          (<span style="color: #a020f0;">else</span> (fast-iter b (- n 1) (* c b)))))
  (fast-iter base exp 1))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">even?</span> n)
  (= (remainder n 2) 0))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">And so here are all of the combinations of space-/time-complexity</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">we've seen so far:</span>

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">my-expt</span> b n)
  (<span style="color: #a020f0;">if</span> (= n 0)
      1
      (* b (my-expt b (- n 1)))))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">my-expt-iter</span> base pow)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">iterate</span> n c)
    (<span style="color: #a020f0;">cond</span> ((= n 0) c)
          (<span style="color: #a020f0;">else</span> (iterate (- n 1) (* base c)))))
  (iterate pow 1))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">my-expt-log</span> base pow)
  (<span style="color: #a020f0;">cond</span> ((= pow 0) 1)
        ((even? pow) (square (my-expt-log base (/ pow 2))))
        (<span style="color: #a020f0;">else</span> (* base (my-expt-log base (- pow 1))))))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">my-expt-iter-log</span> base pow)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">iterate</span> b p c)
    (<span style="color: #a020f0;">cond</span> ((= p 0) c)
          ((even? p) (iterate (* b b) (/ p 2) c))
          (<span style="color: #a020f0;">else</span> (iterate b (- p 1) (* b c)))))
  (iterate base pow 1))
</pre>
</div>
</div>
</div>
<div id="outline-container-org050f0c5" class="outline-3">
<h3 id="org050f0c5">Exercise 1.17</h3>
<div class="outline-text-3" id="text-org050f0c5">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">halve</span> b)
  (/ b 2))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">double</span> b)
  (+ b b))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">mult</span> a b)
  (<span style="color: #a020f0;">cond</span> ((= b 0) 0)
        ((even? b) (double (mult a (halve b))))
        (<span style="color: #a020f0;">else</span> (+ a (mult a (- b 1))))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org541c02c" class="outline-3">
<h3 id="org541c02c">Exercise 1.18</h3>
<div class="outline-text-3" id="text-org541c02c">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">fast-mult</span> x y)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">fast-mult-iter</span> a b c)
    (<span style="color: #a020f0;">cond</span> ((= b 0) c)
          ((even? b) (fast-mult-iter (double a) (- (halve b) 1) (+ c (double a))))
          (<span style="color: #a020f0;">else</span> (fast-mult-iter a (- b 1) (+ c a)))))
  (fast-mult-iter x y 0))
</pre>
</div>
</div>
</div>
