sicp-exercises.html
<div id="outline-container-org7e76851" class="outline-3">
<h3 id="org7e76851">Exercise 1.19</h3>
<div class="outline-text-3" id="text-org7e76851">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">fib</span> n)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">fib-iter</span> a b p q count)
    (<span style="color: #a020f0;">cond</span> ((= count 0) b)
          ((even? count)
           (fib-iter a
                     b
                     (+ (square p) (square q))
                     (+ (* 2 p q) (square q))
                     (/ count 2)))
          (<span style="color: #a020f0;">else</span> (fib-iter (+ (* b q) (* a q) (* a p))
                          (+ (* b p) (* a q))
                          p
                          q
                          (- count 1)))))
  (fib-iter 1 0 0 1 n))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">my-expmod</span> base exp mod)
  <span style="color: #8b2252;">"Generates an iterative process that runs in a logarithmic number of steps"</span>
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">iterate</span> b e i)
    (<span style="color: #a020f0;">cond</span> ((= e 0) i)
          ((even? e) (iterate (remainder (* b b) mod) (/ e 2) i))
          (<span style="color: #a020f0;">else</span> (iterate b (- e 1) (remainder (* b i) mod)))))
  (iterate base exp 1))
</pre>
</div>
</div>
</div>
<div id="outline-container-org26f5baf" class="outline-3">
<h3 id="org26f5baf">Exercise 1.22</h3>
<div class="outline-text-3" id="text-org26f5baf">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">timed-prime-test</span> n)
  (newline)
  (display n)
  (start-prime-test n (runtime)))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">start-prime-test</span> n start-time)
  (<span style="color: #a020f0;">if</span> (prime? n)
      (report-prime (- (runtime) start-time))))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">report-prime</span> elapsed-time)
  (display <span style="color: #8b2252;">" *** "</span>)
  (display elapsed-time))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">search-for-primes</span> a b)
  (<span style="color: #a020f0;">cond</span> ((&lt; a b) (timed-prime-test a)
                 (search-for-primes (+ a 1) b))))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">prime?</span> n)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">iterate</span> i)
    (<span style="color: #a020f0;">cond</span> ((= (remainder n i) 0) #f)
          ((&gt; (* i i) n) #t)
          (<span style="color: #a020f0;">else</span> (iterate (+ i 1)))))
  (iterate 2))
</pre>
</div>
</div>
</div>
<div id="outline-container-org33e23f1" class="outline-3">
<h3 id="org33e23f1">Exercise 1.26</h3>
<div class="outline-text-3" id="text-org33e23f1">
<p>
From a high level, calling expmod with (/ exp 2) halves the
problem. It is this halving, at each iteration of the process, that
allows it to run in a number of steps that is logarithmically
related to the size of the input. When Louis calls expmod twice,
each with a halved problem (the same half) he is doing twice of
half of the original amount of work. Therefore he is doing the
original amount of work, which in the case of computing an exponent
would be n multiplications where n is the power being raised to.
</p>
</div>
</div>
<div id="outline-container-org332034e" class="outline-3">
<h3 id="org332034e">Exercise 1.27</h3>
<div class="outline-text-3" id="text-org332034e">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">fermat-condition?</span> a n)
  (= (my-expmod a n n) (remainder a n)))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">fermat-test?</span> n)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">satisfies?</span> a)
    (<span style="color: #a020f0;">cond</span> ((&gt;= a n) #t)
          ((fermat-condition? a n) (satisfies? (+ a 1)))
          (<span style="color: #a020f0;">else</span> #f)))
  (satisfies? 2))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">carmichael?</span> n)
  (<span style="color: #a020f0;">and</span> (not (prime? n)) (fermat-test? n)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org7c4d38c" class="outline-3">
<h3 id="org7c4d38c">Exercise 1.29</h3>
<div class="outline-text-3" id="text-org7c4d38c">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">simp</span> f a b n)
  (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">h</span> (/ (- b a) n))
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">step</span> x) (+ x h h))
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">cf</span> c x) (* c (f x)))
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">2f</span> x) (cf 2 x))
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">4f</span> x) (cf 4 x))
  (* (/ h 3.0)
     (+ (f a)
        (sum 4f (+ a h) step b)
        (sum 2f (+ a h h) step b)
        (f b))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbf459ae" class="outline-3">
<h3 id="orgbf459ae">Exercise 1.30</h3>
<div class="outline-text-3" id="text-orgbf459ae">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">sum</span> term a next b)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">iter</span> a result)
     (<span style="color: #a020f0;">if</span> (&gt; a b)
         result
         (iter (next a) (+ result (term a)))))
  (iter a 0))
</pre>
</div>
</div>
</div>
<div id="outline-container-orge23f57c" class="outline-3">
<h3 id="orge23f57c">Exercise 1.31</h3>
<div class="outline-text-3" id="text-orge23f57c">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">product-iter</span> term a next b)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">iter</span> a result)
    (<span style="color: #a020f0;">if</span> (&gt; a b)
        result
        (iter (next a) (* result (term a)))))
  (iter a 1))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">product</span> term a next b)
  (<span style="color: #a020f0;">if</span> (&gt; a b)
      1
      (* (term a)
         (product term (next a) next b))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org8f1df28" class="outline-3">
<h3 id="org8f1df28">Exercise 1.32</h3>
<div class="outline-text-3" id="text-org8f1df28">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">accumulate</span> combiner null-val term a next b)
  (<span style="color: #a020f0;">if</span> (&gt; a b)
      null-val
      (combiner (term a)
                (accumulate combiner null-val term (next a) next b))))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">accumulate-iter</span> combiner null-val term a next b)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">iter</span> a result)
    (<span style="color: #a020f0;">if</span> (&gt; a b)
        result
        (iter (next a) (combiner result (term a)))))
  (iter a null-val))
</pre>
</div>
</div>
</div>
<div id="outline-container-orga329437" class="outline-3">
<h3 id="orga329437">Exercise 1.33</h3>
<div class="outline-text-3" id="text-orga329437">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">filtered-accumulate</span> filter combiner null-val term a next b)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">iter</span> a result)
    (<span style="color: #a020f0;">cond</span> ((&gt; a b) result)
          ((filter a) (iter (next a) (combiner result (term a))))
          (<span style="color: #a020f0;">else</span> (iter (next a) (combiner result null-val)))))
  (iter a null-val))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">sum-square-primes</span> a b)
  (filtered-accumulate prime? + 0 square a inc b))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">product-coprimes</span> n)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">filt</span> a)
    (= (gcd a n) 1))
  (filtered-accumulate filt * 1 (<span style="color: #a020f0;">lambda</span> (x) x) 2 inc n))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">gcd</span> a b)
  (<span style="color: #a020f0;">if</span> (= b 0)
      a
      (gcd b (remainder a b))))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">factorial</span> b)
  (product (<span style="color: #a020f0;">lambda</span> (x) x) 2 (<span style="color: #a020f0;">lambda</span> (x) (+ x 1)) b))
</pre>
</div>

<p>
Let is syntactic sugar for the underlying lambda application!
</p>

<p>
Iterative approximation of pi
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">4square</span> x)
  (* 4 (square x)))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">4square1</span> x)
  (- (4square x) 1))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">inc</span> x)
  (+ x 1))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">pi-approx</span> n)
  (* 2.0 (/ (product-iter 4square 1 inc n)
            (product-iter 4square1 1 inc n))))
</pre>
</div>
</div>
</div>
