org/sicp-exercises.org
** Exercise 1.36
#+BEGIN_SRC scheme
(define tolerance 0.00001)
(define (fixed-point f first-guess)
  (define (close-enough? v1 v2)
    (< (abs (- v1 v2)) tolerance))
  (define (try guess)
    (newline)
    (display guess)
    (let ((next (f guess)))
      (if (close-enough? guess next)
          next
          (try next))))
  (try first-guess))
#+END_SRC
** Exercise 1.37
#+BEGIN_SRC scheme
(define (cont-frac n d k)
  (define (recurse i)
    (if (= i k)
        0
        (/ (n i)
           (+ (d i) (recurse (+ i 1))))))
  (recurse 1))
(define (cont-frac n d k)
  (define (iter i result)
    (if (= i 0)
        result
        (iter (- i 1) (/ (n i)
                         (+ (d i) result)))))
  (iter k 0))
#+END_SRC
** Exercise 1.38
#+BEGIN_SRC scheme
(define (e-approx k)
  (define (d k)
    (if (= (remainder k 3) 2)
        (+ 2.0 (* 2 (quotient k 3)))
        1.0))
  (+ 2 (cont-frac (lambda (x) 1.0) d k)))
#+END_SRC
** Exercise 1.39
#+BEGIN_SRC scheme
(define (tan-cf x k)
  (cont-frac (lambda (i) (if (= i 1)
                             x
                             (* -1.0 (square x))))
             (lambda (i) (- (* 2 i) 1.0))
             k))

#+END_SRC
** Exercise 1.40
#+BEGIN_SRC scheme
(define (cubic a b c)
  (lambda (x) (+ (cube x) (* a (square x)) (* b x) c)))

#+END_SRC
** Exercise 1.41
#+BEGIN_SRC scheme
(define (double f)
  (lambda (x) (f (f x))))
#+END_SRC
** Exercise 1.42
#+BEGIN_SRC scheme
(define (compose f g)
  (lambda (x) (f (g x))))

#+END_SRC
** Exercise 1.43
#+BEGIN_SRC scheme
(define (repeated f n)
  (if (= n 1)
      f
      (compose f (repeated f (- n 1)))))
(define (repeated-iter f n)
  (define (iter i g)
    (if (= i n)
        g
        (iter (+ i 1) (compose f g))))
  (iter 1 f))
(define (repeated-log f n)
  (cond ((= n 1) f)
        ((even? n) (repeated-log (compose f f) (/ n 2)))
        (else (compose f (repeated-log f (- n 1))))))

#+END_SRC
** Exercise 1.44
#+BEGIN_SRC scheme
(define (sum-list l)
  (if (null? l)
      0
      (+ (car l) (sum-list (cdr l)))))
(define (average-list l)
  (/ (sum-list l) (length l)))
(define (smooth f)
  (lambda (x) (average-list (list (f (- x dx))
                                  (f x)
                                  (f (+ x dx))))))
(define (n-fold-smoothed f n)
  ((repeated smooth n) f))

#+END_SRC
** Exercise 1.45
One average-damp works until fourth roots

Two average-damp's work until eighth roots

Three average-damp's work until sixteenth roots

I see a pattern...
#+BEGIN_SRC scheme
(define (average-damp f)
  (lambda (x) (average (list x (f x)))))
(define (sqrt x)
  (fixed-point (average-damp (lambda (y) (/ x y)))
               1.0))
(define (lb x)
  (/ (log x) (log 2)))
(define (nth-root k n)
  (fixed-point
   ((repeated average-damp (floor (lb n))) (lambda (x) (/ k (my-expt x (- n 1)))))
   1.0))
(define (difference a b)
  (abs (- a b)))
(define (test-nth-root base exp)
  (< (difference base
                 (nth-root (my-expt base exp)
                           exp))
     0.01))
#+END_SRC
** Exercise 1.46
#+BEGIN_SRC scheme
(define (iterative-improve good-enough? improve-guess)
  (lambda (guess)
    (define (iterate g)
      (if (good-enough? g)
          g
          (iterate (improve-guess g))))
    (iterate guess)))
(define (iterative-improve-sqrt x)
  ((iterative-improve (lambda (g) (< (difference (square g) x) 0.001))
                      (lambda (g) (average (list g (/ x g))))) 1.0))
(define (iterative-improve-fixed-point func first-guess)
  ((iterative-improve (lambda (g) (< (difference g (func g)) 0.00001))
                      func) first-guess))

#+END_SRC
The general technique of isolating the parts of a program that deal
with how data objects are represented from the parts of a program
that deal with how data objects are used is a powerful design
methodology called "data abstraction".
* Chapter 2
** Exercise 2.1
#+BEGIN_SRC scheme
(define (same-sign? a b)
  (> (* a b) 0))
(define (make-rat n d)
  (let ((g (gcd n d)))
    (cons (* (cond ((same-sign? n d) 1)
                   (else -1))
             (abs (/ n g)))
          (abs (/ d g)))))
(define (numer x) (car x))
(define (denom x) (cdr x))
(define (print-rat x)
  (newline)
  (display (numer x))
  (display "/")
  (display (denom x)))
 
#+END_SRC
