sicp-exercises.html
<div id="outline-container-org6b91e14" class="outline-3">
<h3 id="org6b91e14">Exercise 1.35</h3>
<div class="outline-text-3" id="text-org6b91e14">
<p>
x<sup>2</sup> |-&gt; x + 1
</p>

<p>
x<sup>2</sup> - x - 1 = 0
</p>

<p>
(-(-1) +- sqrt((-1)<sup>2</sup> - 4(-1)))/2
</p>

<p>
(1 +- sqrt(5))/2
</p>
</div>
</div>
<div id="outline-container-org7cf2b56" class="outline-3">
<h3 id="org7cf2b56">Exercise 1.36</h3>
<div class="outline-text-3" id="text-org7cf2b56">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">tolerance</span> 0.00001)
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">fixed-point</span> f first-guess)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">close-enough?</span> v1 v2)
    (&lt; (abs (- v1 v2)) tolerance))
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">try</span> guess)
    (newline)
    (display guess)
    (<span style="color: #a020f0;">let</span> ((next (f guess)))
      (<span style="color: #a020f0;">if</span> (close-enough? guess next)
          next
          (try next))))
  (try first-guess))
</pre>
</div>
</div>
</div>
<div id="outline-container-org758f8e1" class="outline-3">
<h3 id="org758f8e1">Exercise 1.37</h3>
<div class="outline-text-3" id="text-org758f8e1">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">cont-frac</span> n d k)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">recurse</span> i)
    (<span style="color: #a020f0;">if</span> (= i k)
        0
        (/ (n i)
           (+ (d i) (recurse (+ i 1))))))
  (recurse 1))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">cont-frac</span> n d k)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">iter</span> i result)
    (<span style="color: #a020f0;">if</span> (= i 0)
        result
        (iter (- i 1) (/ (n i)
                         (+ (d i) result)))))
  (iter k 0))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgce473b0" class="outline-3">
<h3 id="orgce473b0">Exercise 1.38</h3>
<div class="outline-text-3" id="text-orgce473b0">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">e-approx</span> k)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">d</span> k)
    (<span style="color: #a020f0;">if</span> (= (remainder k 3) 2)
        (+ 2.0 (* 2 (quotient k 3)))
        1.0))
  (+ 2 (cont-frac (<span style="color: #a020f0;">lambda</span> (x) 1.0) d k)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb6078a4" class="outline-3">
<h3 id="orgb6078a4">Exercise 1.39</h3>
<div class="outline-text-3" id="text-orgb6078a4">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">tan-cf</span> x k)
  (cont-frac (<span style="color: #a020f0;">lambda</span> (i) (<span style="color: #a020f0;">if</span> (= i 1)
                             x
                             (* -1.0 (square x))))
             (<span style="color: #a020f0;">lambda</span> (i) (- (* 2 i) 1.0))
             k))

</pre>
</div>
</div>
</div>
<div id="outline-container-org0ebcad8" class="outline-3">
<h3 id="org0ebcad8">Exercise 1.40</h3>
<div class="outline-text-3" id="text-org0ebcad8">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">cubic</span> a b c)
  (<span style="color: #a020f0;">lambda</span> (x) (+ (cube x) (* a (square x)) (* b x) c)))

</pre>
</div>
</div>
</div>
<div id="outline-container-org04b1c96" class="outline-3">
<h3 id="org04b1c96">Exercise 1.41</h3>
<div class="outline-text-3" id="text-org04b1c96">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">double</span> f)
  (<span style="color: #a020f0;">lambda</span> (x) (f (f x))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org69a3a98" class="outline-3">
<h3 id="org69a3a98">Exercise 1.42</h3>
<div class="outline-text-3" id="text-org69a3a98">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">compose</span> f g)
  (<span style="color: #a020f0;">lambda</span> (x) (f (g x))))

</pre>
</div>
</div>
</div>
<div id="outline-container-org2686c41" class="outline-3">
<h3 id="org2686c41">Exercise 1.43</h3>
<div class="outline-text-3" id="text-org2686c41">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">repeated</span> f n)
  (<span style="color: #a020f0;">if</span> (= n 1)
      f
      (compose f (repeated f (- n 1)))))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">repeated-iter</span> f n)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">iter</span> i g)
    (<span style="color: #a020f0;">if</span> (= i n)
        g
        (iter (+ i 1) (compose f g))))
  (iter 1 f))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">repeated-log</span> f n)
  (<span style="color: #a020f0;">cond</span> ((= n 1) f)
        ((even? n) (repeated-log (compose f f) (/ n 2)))
        (<span style="color: #a020f0;">else</span> (compose f (repeated-log f (- n 1))))))

</pre>
</div>
</div>
</div>
<div id="outline-container-orge2de97a" class="outline-3">
<h3 id="orge2de97a">Exercise 1.44</h3>
<div class="outline-text-3" id="text-orge2de97a">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">sum-list</span> l)
  (<span style="color: #a020f0;">if</span> (null? l)
      0
      (+ (car l) (sum-list (cdr l)))))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">average-list</span> l)
  (/ (sum-list l) (length l)))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">smooth</span> f)
  (<span style="color: #a020f0;">lambda</span> (x) (average-list (list (f (- x dx))
                                  (f x)
                                  (f (+ x dx))))))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">n-fold-smoothed</span> f n)
  ((repeated smooth n) f))

</pre>
</div>
</div>
</div>
<div id="outline-container-org8c2f479" class="outline-3">
<h3 id="org8c2f479">Exercise 1.45</h3>
<div class="outline-text-3" id="text-org8c2f479">
<p>
One average-damp works until fourth roots
</p>

<p>
Two average-damp's work until eighth roots
</p>

<p>
Three average-damp's work until sixteenth roots
</p>

<p>
I see a pattern&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">average-damp</span> f)
  (<span style="color: #a020f0;">lambda</span> (x) (average (list x (f x)))))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">sqrt</span> x)
  (fixed-point (average-damp (<span style="color: #a020f0;">lambda</span> (y) (/ x y)))
               1.0))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">lb</span> x)
  (/ (log x) (log 2)))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">nth-root</span> k n)
  (fixed-point
   ((repeated average-damp (floor (lb n))) (<span style="color: #a020f0;">lambda</span> (x) (/ k (my-expt x (- n 1)))))
   1.0))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">difference</span> a b)
  (abs (- a b)))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">test-nth-root</span> base exp)
  (&lt; (difference base
                 (nth-root (my-expt base exp)
                           exp))
     0.01))
</pre>
</div>
</div>
</div>
<div id="outline-container-org8aa565b" class="outline-3">
<h3 id="org8aa565b">Exercise 1.46</h3>
<div class="outline-text-3" id="text-org8aa565b">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">iterative-improve</span> good-enough? improve-guess)
  (<span style="color: #a020f0;">lambda</span> (guess)
    (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">iterate</span> g)
      (<span style="color: #a020f0;">if</span> (good-enough? g)
          g
          (iterate (improve-guess g))))
    (iterate guess)))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">iterative-improve-sqrt</span> x)
  ((iterative-improve (<span style="color: #a020f0;">lambda</span> (g) (&lt; (difference (square g) x) 0.001))
                      (<span style="color: #a020f0;">lambda</span> (g) (average (list g (/ x g))))) 1.0))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">iterative-improve-fixed-point</span> func first-guess)
  ((iterative-improve (<span style="color: #a020f0;">lambda</span> (g) (&lt; (difference g (func g)) 0.00001))
                      func) first-guess))

</pre>
</div>
<p>
The general technique of isolating the parts of a program that deal
with how data objects are represented from the parts of a program
that deal with how data objects are used is a powerful design
methodology called "data abstraction".
</p>
</div>
</div>
</div>
<div id="outline-container-orge9f41a1" class="outline-2">
<h2 id="orge9f41a1">Chapter 2</h2>
<div class="outline-text-2" id="text-orge9f41a1">
</div>
<div id="outline-container-org5b3fec8" class="outline-3">
<h3 id="org5b3fec8">Exercise 2.1</h3>
<div class="outline-text-3" id="text-org5b3fec8">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">same-sign?</span> a b)
  (&gt; (* a b) 0))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">make-rat</span> n d)
  (<span style="color: #a020f0;">let</span> ((g (gcd n d)))
    (cons (* (<span style="color: #a020f0;">cond</span> ((same-sign? n d) 1)
                   (<span style="color: #a020f0;">else</span> -1))
             (abs (/ n g)))
          (abs (/ d g)))))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">numer</span> x) (car x))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">denom</span> x) (cdr x))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">print-rat</span> x)
  (newline)
  (display (numer x))
  (display <span style="color: #8b2252;">"/"</span>)
  (display (denom x)))

</pre>
</div>
</div>
</div>
