org/sicp-exercises.org
** Exercise 2.2
#+BEGIN_SRC scheme
(define (make-point x y)
  (cons x y))
(define (x-point p) (car p))
(define (y-point p) (cdr p))
(define (point-less p1 p2)
  (or (< (x-point p1) (x-point p2))
      (and (= (x-point p1) (x-point p2))
           (< (y-point p1) (y-point p2)))))
(define (point-equal p1 p2)
  (and (= (x-point p1) (x-point p2))
       (= (y-point p1) (y-point p2))))
(define (point-equal p1 p2)
  (and (not (point-less p1 p2))
       (not (point-less p2 p1))))
(define (make-segment start end)
  (cond ((point-less start end) (cons start end))
        (else (cons end start))))
(define (start-segment seg) (car seg))
(define (end-segment seg) (cdr seg))
(define (average a b)
  (/ (+ a b) 2))
(define (midpoint-segment seg)
  (make-point (average (x-point (start-segment seg))
                       (x-point (end-segment seg)))
              (average (y-point (start-segment seg))
                       (y-point (end-segment seg)))))
(define (print-point p)
  (newline)
  (display "(")
  (display (x-point p))
  (display ",")
  (display (y-point p))
  (display ")"))

#+END_SRC
** Exercise 2.3
#+BEGIN_SRC scheme
(define (make-rectangle corner1 corner2)
  (cond ((or (= (x-point corner1) (x-point corner2))
             (= (y-point corner1) (y-point corner2)))
         (error "Points define a segment"))
        ((point-less corner1 corner2) (cons corner1 corner2))
        (else (cons corner2 corner1))))
(define (height rect)
  (difference (y-point (car rect)) (y-point (cdr rect))))
(define (width rect)
  (difference (x-point (car rect)) (x-point (cdr rect))))
#+END_SRC
I won't get much more out of this by continuing...
** Exercise 2.4
#+BEGIN_SRC scheme
(define (my-cons x y)
  (lambda (m) (m x y)))
(define (my-car z)
  (z (lambda (p q) p)))
(define (my-cdr z)
  (z (lambda (p q) q)))
#+END_SRC
(my-cdr (my-cons 1 2))

((my-cons 1 2) (lambda (p q) q))

((lambda (m) (m 1 2)) (lambda (p q) q))

((lambda (p q) q) 1 2)

2
** Exercise 2.5
#+BEGIN_SRC scheme
(define (log-base base value)
  (/ (log value) (log base)))
(define (factor-out factor value)
  (if (= (remainder value factor) 0)
      (factor-out factor (/ value factor))
      value))
(define (my-cons x y)
  (* (my-expt 2 x) (my-expt 3 y)))
(define (my-car p)
  (log-base 2 (factor-out 3 p)))
(define (my-cdr p)
  (log-base 3 (factor-out 2 p)))

#+END_SRC
** Exercise 2.6
#+BEGIN_SRC scheme
(define zero (lambda (f) (lambda (x) x)))
(define (add-1 n)
  (lambda (f) (lambda (x) (f ((n f) x)))))
#+END_SRC
(add-1 zero)

(lambda (f) (lambda (x) (f ((zero f) x))))

(lambda (f) (lambda (x) (f (((lambda (q) (lambda (z) z)) f) x))))

(lambda (f) (lambda (x) (f ((lambda (z) z) x))))

(lambda (f) (lambda (x) (f x)))

(lambda (f) (lambda (x) (f x)))

(add-1 (lambda (f) (lambda (x) (f x))))

(lambda (f) (lambda (x) (f (((lambda (g) (lambda (x) (g x))) f) x))))

(lambda (f) (lambda (x) (f ((lambda (x) (f x)) x))))

(lambda (f) (lambda (x) (f (f x))))
#+BEGIN_SRC scheme
(define (plus a b)
  (lambda (f) (compose (a f) (b f))))
#+END_SRC
** Exercise 2.7
#+BEGIN_SRC scheme
(define (make-interval a b) (cons a b))
(define (lower-bound int)
  (min (car int) (cdr int)))
(define (upper-bound int)
  (max (car int) (cdr int)))
#+END_SRC
** Exercise 2.8
#+BEGIN_SRC scheme
(define (sub-interval x y)
  (make-interval (- (lower-bound x) (upper-bound y))
                 (- (upper-bound x) (lower-bound y))))

#+END_SRC
** Exercise 2.9
Let x = (a b) and y = (c d) be intervals. Then width(x) = (b-a)/2 and
width(y) = (d-c)/2. Well width(x+y) = width((a+c b+d)) = (b+d-a-c)/2 =
(b-a)/2 + (d-c)/2 = width(x)+width(y). And width(x-y) = width((a-d
b-c)) = (b-c-a+d)/2 = width(x) + width(y). Now let x1 = (1 2), x2 =
(3 4) and x3 = (5 6). Well width(x1) = width(x2) = width(x3) =
1/2. But width(x1*x2) = width((3 8)) = 5/2 and width(x2*x3) =
width(15 24) = 9/2. If product width were a function only of factor
widths then width(x1*x2) would equal width(x2*x3) (because width(x1) =
width(x2) = width(x3) = 1/2) but this is not the case. Similarly,
width(x1/x2) = width((1/4 2/3)) = 5/24 != width(x2/x3) = width((1/3
4/5)) = 7/30.
** Exercise 2.10
:LOGBOOK:
CLOCK: [2020-05-05 Tue 15:32]--[2020-05-05 Tue 16:00] =>  0:28
:END:
#+BEGIN_SRC scheme
(define (width-interval x)
  (/ (- (upper-bound x) (lower-bound x)) 2))
(define (mul-interval x y)
       (let ((p1 (* (lower-bound x) (lower-bound y)))
             (p2 (* (lower-bound x) (upper-bound y)))
             (p3 (* (upper-bound x) (lower-bound y)))
             (p4 (* (upper-bound x) (upper-bound y))))
         (make-interval (min p1 p2 p3 p4)
                        (max p1 p2 p3 p4))))
(define (div-interval x y)
  (if (= (width-interval y) 0)
      (error "Division by zero-width interval")
      (mul-interval x
      (make-interval (/ 1.0 (upper-bound y))
      (/ 1.0 (lower-bound y))))))
#+END_SRC
