sicp-exercises.html
<div id="outline-container-orgbe1976e" class="outline-3">
<h3 id="orgbe1976e">Exercise 2.2</h3>
<div class="outline-text-3" id="text-orgbe1976e">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">make-point</span> x y)
  (cons x y))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">x-point</span> p) (car p))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">y-point</span> p) (cdr p))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">point-less</span> p1 p2)
  (<span style="color: #a020f0;">or</span> (&lt; (x-point p1) (x-point p2))
      (<span style="color: #a020f0;">and</span> (= (x-point p1) (x-point p2))
           (&lt; (y-point p1) (y-point p2)))))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">point-equal</span> p1 p2)
  (<span style="color: #a020f0;">and</span> (= (x-point p1) (x-point p2))
       (= (y-point p1) (y-point p2))))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">point-equal</span> p1 p2)
  (<span style="color: #a020f0;">and</span> (not (point-less p1 p2))
       (not (point-less p2 p1))))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">make-segment</span> start end)
  (<span style="color: #a020f0;">cond</span> ((point-less start end) (cons start end))
        (<span style="color: #a020f0;">else</span> (cons end start))))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">start-segment</span> seg) (car seg))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">end-segment</span> seg) (cdr seg))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">average</span> a b)
  (/ (+ a b) 2))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">midpoint-segment</span> seg)
  (make-point (average (x-point (start-segment seg))
                       (x-point (end-segment seg)))
              (average (y-point (start-segment seg))
                       (y-point (end-segment seg)))))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">print-point</span> p)
  (newline)
  (display <span style="color: #8b2252;">"("</span>)
  (display (x-point p))
  (display <span style="color: #8b2252;">","</span>)
  (display (y-point p))
  (display <span style="color: #8b2252;">")"</span>))

</pre>
</div>
</div>
</div>
<div id="outline-container-org130ec5c" class="outline-3">
<h3 id="org130ec5c">Exercise 2.3</h3>
<div class="outline-text-3" id="text-org130ec5c">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">make-rectangle</span> corner1 corner2)
  (<span style="color: #a020f0;">cond</span> ((<span style="color: #a020f0;">or</span> (= (x-point corner1) (x-point corner2))
             (= (y-point corner1) (y-point corner2)))
         (error <span style="color: #8b2252;">"Points define a segment"</span>))
        ((point-less corner1 corner2) (cons corner1 corner2))
        (<span style="color: #a020f0;">else</span> (cons corner2 corner1))))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">height</span> rect)
  (difference (y-point (car rect)) (y-point (cdr rect))))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">width</span> rect)
  (difference (x-point (car rect)) (x-point (cdr rect))))
</pre>
</div>
<p>
I won't get much more out of this by continuing&#x2026;
</p>
</div>
</div>
<div id="outline-container-org02e24fc" class="outline-3">
<h3 id="org02e24fc">Exercise 2.4</h3>
<div class="outline-text-3" id="text-org02e24fc">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">my-cons</span> x y)
  (<span style="color: #a020f0;">lambda</span> (m) (m x y)))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">my-car</span> z)
  (z (<span style="color: #a020f0;">lambda</span> (p q) p)))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">my-cdr</span> z)
  (z (<span style="color: #a020f0;">lambda</span> (p q) q)))
</pre>
</div>
<p>
(my-cdr (my-cons 1 2))
</p>

<p>
((my-cons 1 2) (lambda (p q) q))
</p>

<p>
((lambda (m) (m 1 2)) (lambda (p q) q))
</p>

<p>
((lambda (p q) q) 1 2)
</p>

<p>
2
</p>
</div>
</div>
<div id="outline-container-org0718db6" class="outline-3">
<h3 id="org0718db6">Exercise 2.5</h3>
<div class="outline-text-3" id="text-org0718db6">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">log-base</span> base value)
  (/ (log value) (log base)))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">factor-out</span> factor value)
  (<span style="color: #a020f0;">if</span> (= (remainder value factor) 0)
      (factor-out factor (/ value factor))
      value))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">my-cons</span> x y)
  (* (my-expt 2 x) (my-expt 3 y)))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">my-car</span> p)
  (log-base 2 (factor-out 3 p)))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">my-cdr</span> p)
  (log-base 3 (factor-out 2 p)))

</pre>
</div>
</div>
</div>
<div id="outline-container-org3b88db8" class="outline-3">
<h3 id="org3b88db8">Exercise 2.6</h3>
<div class="outline-text-3" id="text-org3b88db8">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">zero</span> (<span style="color: #a020f0;">lambda</span> (f) (<span style="color: #a020f0;">lambda</span> (x) x)))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">add-1</span> n)
  (<span style="color: #a020f0;">lambda</span> (f) (<span style="color: #a020f0;">lambda</span> (x) (f ((n f) x)))))
</pre>
</div>
<p>
(add-1 zero)
</p>

<p>
(lambda (f) (lambda (x) (f ((zero f) x))))
</p>

<p>
(lambda (f) (lambda (x) (f (((lambda (q) (lambda (z) z)) f) x))))
</p>

<p>
(lambda (f) (lambda (x) (f ((lambda (z) z) x))))
</p>

<p>
(lambda (f) (lambda (x) (f x)))
</p>

<p>
(lambda (f) (lambda (x) (f x)))
</p>

<p>
(add-1 (lambda (f) (lambda (x) (f x))))
</p>

<p>
(lambda (f) (lambda (x) (f (((lambda (g) (lambda (x) (g x))) f) x))))
</p>

<p>
(lambda (f) (lambda (x) (f ((lambda (x) (f x)) x))))
</p>

<p>
(lambda (f) (lambda (x) (f (f x))))
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">plus</span> a b)
  (<span style="color: #a020f0;">lambda</span> (f) (compose (a f) (b f))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgeee9703" class="outline-3">
<h3 id="orgeee9703">Exercise 2.7</h3>
<div class="outline-text-3" id="text-orgeee9703">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">make-interval</span> a b) (cons a b))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">lower-bound</span> int)
  (min (car int) (cdr int)))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">upper-bound</span> int)
  (max (car int) (cdr int)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf2a855d" class="outline-3">
<h3 id="orgf2a855d">Exercise 2.8</h3>
<div class="outline-text-3" id="text-orgf2a855d">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">sub-interval</span> x y)
  (make-interval (- (lower-bound x) (upper-bound y))
                 (- (upper-bound x) (lower-bound y))))

</pre>
</div>
</div>
</div>
<div id="outline-container-orgc89f6ef" class="outline-3">
<h3 id="orgc89f6ef">Exercise 2.9</h3>
<div class="outline-text-3" id="text-orgc89f6ef">
<p>
Let x = (a b) and y = (c d) be intervals. Then width(x) = (b-a)/2 and
width(y) = (d-c)/2. Well width(x+y) = width((a+c b+d)) = (b+d-a-c)/2 =
(b-a)/2 + (d-c)/2 = width(x)+width(y). And width(x-y) = width((a-d
b-c)) = (b-c-a+d)/2 = width(x) + width(y). Now let x1 = (1 2), x2 =
(3 4) and x3 = (5 6). Well width(x1) = width(x2) = width(x3) =
1/2. But width(x1*x2) = width((3 8)) = 5/2 and width(x2*x3) =
width(15 24) = 9/2. If product width were a function only of factor
widths then width(x1*x2) would equal width(x2*x3) (because width(x1) =
width(x2) = width(x3) = 1/2) but this is not the case. Similarly,
width(x1/x2) = width((1/4 2/3)) = 5/24 != width(x2/x3) = width((1/3
4/5)) = 7/30.
</p>
</div>
</div>
<div id="outline-container-orgf82bdff" class="outline-3">
<h3 id="orgf82bdff">Exercise 2.10</h3>
<div class="outline-text-3" id="text-orgf82bdff">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">width-interval</span> x)
  (/ (- (upper-bound x) (lower-bound x)) 2))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">mul-interval</span> x y)
       (<span style="color: #a020f0;">let</span> ((p1 (* (lower-bound x) (lower-bound y)))
             (p2 (* (lower-bound x) (upper-bound y)))
             (p3 (* (upper-bound x) (lower-bound y)))
             (p4 (* (upper-bound x) (upper-bound y))))
         (make-interval (min p1 p2 p3 p4)
                        (max p1 p2 p3 p4))))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">div-interval</span> x y)
  (<span style="color: #a020f0;">if</span> (= (width-interval y) 0)
      (error <span style="color: #8b2252;">"Division by zero-width interval"</span>)
      (mul-interval x
      (make-interval (/ 1.0 (upper-bound y))
      (/ 1.0 (lower-bound y))))))
</pre>
</div>
</div>
</div>
