sicp-exercises.html
<div id="outline-container-org277035b" class="outline-3">
<h3 id="org277035b">Exercise 2.11</h3>
<div class="outline-text-3" id="text-org277035b">
<p>
If we're multiplying intervals \(i=(a,b)\) and \(j=(x,y)\) then we must have \(a \leq
b\) and \(x \leq y\) and so we have the following cases:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">\(a \leq b < 0\)</th>
<th scope="col" class="org-left">\(a < 0 \leq b\)</th>
<th scope="col" class="org-left">\(0 \leq a \leq b\)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">\(x \leq y < 0\)</td>
<td class="org-left">\((by,ax)\)</td>
<td class="org-left">\((bx,ax)\)</td>
<td class="org-left">\((bx,ay)\)</td>
</tr>

<tr>
<td class="org-left">\(x < 0 \leq y\)</td>
<td class="org-left">\((ay,ax)\)</td>
<td class="org-left">\((min(ay,bx),min(ax,by))\)</td>
<td class="org-left">\((bx,by)\)</td>
</tr>

<tr>
<td class="org-left">\(0 \leq x \leq y\)</td>
<td class="org-left">\((ay,bx)\)</td>
<td class="org-left">\((ay,by)\)</td>
<td class="org-left">\((ax,by)\)</td>
</tr>
</tbody>
</table>
<p>
For simplicity's sake, we notice that multiplication is commutative
and simplify our table:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">\(a \leq b < 0\)</th>
<th scope="col" class="org-left">\(a < 0 \leq b\)</th>
<th scope="col" class="org-left">\(0 \leq a \leq b\)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">\(x \leq y < 0\)</td>
<td class="org-left">\((by,ax)\)</td>
<td class="org-left">\((bx,ax)\)</td>
<td class="org-left">\((bx,ay)\)</td>
</tr>

<tr>
<td class="org-left">\(x < 0 \leq y\)</td>
<td class="org-left">\(j*i\)</td>
<td class="org-left">\((min(ay,bx),min(ax,by))\)</td>
<td class="org-left">\((bx,by)\)</td>
</tr>

<tr>
<td class="org-left">\(0 \leq x \leq y\)</td>
<td class="org-left">\(j*i\)</td>
<td class="org-left">\(j*i\)</td>
<td class="org-left">\((ax,by)\)</td>
</tr>
</tbody>
</table>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">mul-interval</span> i j)
  (<span style="color: #a020f0;">let</span> ((a (lower-bound i))
        (b (upper-bound i))
        (x (lower-bound j))
        (y (upper-bound j)))
    (<span style="color: #a020f0;">cond</span> ((&lt; b 0) (<span style="color: #a020f0;">if</span> (&lt; y 0)
                       (make-interval (* b y) (* a x))
                       (mul-interval j i)))
          ((&lt; a 0) (<span style="color: #a020f0;">cond</span> ((&lt; y 0) (make-interval (* b x) (* a x)))
                         ((&lt; x 0) (make-interval (min (* a y) (* b x))
                                                 (max (* a x) (* b y))))
                         (<span style="color: #a020f0;">else</span> (mul-interval j i))))
          (<span style="color: #a020f0;">else</span> (<span style="color: #a020f0;">cond</span> ((&lt; y 0) (make-interval (* b x) (* a y)))
                      ((&lt; x 0) (make-interval (* b x) (* b y)))
                      (<span style="color: #a020f0;">else</span> (make-interval (* a x) (* b y))))))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orga3a333f" class="outline-3">
<h3 id="orga3a333f">Exercise 2.12</h3>
<div class="outline-text-3" id="text-orga3a333f">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">make-center-width</span> c w)
  (make-interval (- c w) (+ c w)))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">center</span> i)
  (/ (+ (lower-bound i) (upper-bound i)) 2))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">width</span> i)
  (/ (- (upper-bound i) (lower-bound i)) 2))  
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">make-center-percent</span> c p)
  (make-center-width c (* c p)))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">percent</span> i)
  (/ (width i) (center i)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org2f52729" class="outline-3">
<h3 id="org2f52729">Exercise 2.13</h3>
<div class="outline-text-3" id="text-org2f52729">
<p>
Let interval \(i\) have center \(c_{i}\) and tolerance \(p_{i}\). Let
interval \(j\) have center \(c_{j}\) and tolerance \(p_{j}\). Then \(i =
(c_{i}-c_{i}p_{i},c_{i}+c_{i}p_{i})\) and \(j =
(c_{j}-c_{j}p_{j},c_{j}+c_{j}p_{j})\). Suppose \(c_{i} > 0\) and \(c_{j} >
0\). Then \[i*j =
((c_{i}-c_{i}p_{i})*(c_{j}-c_{j}p_{j}),(c_{i}+c_{i}p_{i})*(c_{j}+c_{j}p_{j}))\]
\[= (c_{i}(1-p_{i})c_{j}(1-p_{j}),c_{i}(1+p_{i})c_{j}(1+p_{j}))\] \[=
(c_{i}c_{j}(1-p_{i})(1-p_{j}),c_{i}c_{j}(1+p_{i})(1+p_{j}))\] Supposing
small percentage tolerances: \[=
(c_{i}c_{j}(1-p_{i}-p_{j}),c_{i}c_{j}(1+p_{i}+p_{j}))\] Therefore \(i*j\)
is an interval centered at \(c_{i}c_{j}\) with tolerance
\(p_{i}+p_{j}\).
</p>
</div>
</div>
<div id="outline-container-org219032b" class="outline-3">
<h3 id="org219032b">Exercise 2.14</h3>
<div class="outline-text-3" id="text-org219032b">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">add-interval</span> x y)
  (make-interval (+ (lower-bound x) (lower-bound y))
                 (+ (upper-bound x) (upper-bound y))))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">par1</span> r1 r2)
  (div-interval (mul-interval r1 r2)
                (add-interval r1 r2)))

  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">par2</span> r1 r2)
    (<span style="color: #a020f0;">let</span> ((one (make-interval 1 1)))
      (div-interval one
                    (add-interval (div-interval one r1)
                                  (div-interval one r2)))))
</pre>
</div>
<p>
Let \(R_{1} = (a_{1},b_{1})\) and \(R_{2} = (a_{2},b_{2})\). Expanding, we
see: \[\frac{R_{1}R_{2}}{R_{1}+R_{2}} =
(\frac{a_{1}a_{2}}{b_{1}+b_{2}},\frac{b_{1}b_{2}}{a_{1}+a_{2}})\]
\[\frac{1}{\frac{1}{R_{1}}+\frac{1}{R_{2}}} =
(\frac{a_{1}a_{2}}{a_{1}+a_{2}},\frac{b_{1}b_{2}}{b_{1}+b_{2}})\] This
can be verified in the REPL.
</p>
</div>
</div>
<div id="outline-container-org7c9f305" class="outline-3">
<h3 id="org7c9f305">Exercise 2.17</h3>
<div class="outline-text-3" id="text-org7c9f305">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">last-pair</span> l)
  (<span style="color: #a020f0;">if</span> (null? (cdr l))
      l
      (last-pair (cdr l))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbc40bcb" class="outline-3">
<h3 id="orgbc40bcb">Exercise 2.18</h3>
<div class="outline-text-3" id="text-orgbc40bcb">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">reverse</span> l)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">helper</span> in out)
    (<span style="color: #a020f0;">if</span> (null? in)
        out
        (helper (cdr in) (cons (car in) out))))
  (helper l ()))
</pre>
</div>
</div>
</div>
<div id="outline-container-org82099e0" class="outline-3">
<h3 id="org82099e0">Exercise 2.19</h3>
<div class="outline-text-3" id="text-org82099e0">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">no-more?</span> null?)
(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">except-first-denomination</span> cdr)
(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">first-denomination</span> car)
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">cc</span> amount coin-values)
  (<span style="color: #a020f0;">cond</span> ((= amount 0) 1)
        ((<span style="color: #a020f0;">or</span> (&lt; amount 0) (no-more? coin-values)) 0)
        (<span style="color: #a020f0;">else</span>
         (+ (cc amount
                (except-first-denomination coin-values))
            (cc (- amount
                   (first-denomination coin-values))
                coin-values)))))
</pre>
</div>
<p>
The order of the list coin-values still does not affect the
output because the procedure does not rely on any assumptions
regarding the order of coin-values.
</p>
</div>
</div>
<div id="outline-container-org146f41c" class="outline-3">
<h3 id="org146f41c">Exercise 2.20</h3>
<div class="outline-text-3" id="text-org146f41c">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">same-parity?</span> a b)
  (= (remainder a 2) (remainder b 2)))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">same-parity</span> x . l)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">filterer</span> sublist)
    (<span style="color: #a020f0;">cond</span> ((null? sublist) sublist)
          ((same-parity? x (car sublist))
           (cons (car sublist) (filterer (cdr sublist))))
          (<span style="color: #a020f0;">else</span> (filterer (cdr sublist)))))
  (cons x (filterer l)))
</pre>
</div>
</div>
</div>
