org/sicp-exercises.org
** Exercise 2.21
#+BEGIN_SRC scheme
    (define (square-list items)
      (if (null? items)
          items
          (cons (square (car items))
                (square-list (cdr items)))))
    (define (square-list-map items)
      (map square items))
#+END_SRC
** Exercise 2.22
:LOGBOOK:
CLOCK: [2020-05-06 Wed 13:47]--[2020-05-06 Wed 13:49] =>  0:02
:END:
Elements appearing first in the input list will be added to the head
of the ouput list before elements appearing later. Therefore, elements
appearing first in the input will appear later in the output.

Now, the output isn't a list.
** Exercise 2.23
:LOGBOOK:
CLOCK: [2020-05-06 Wed 13:50]--[2020-05-06 Wed 14:18] =>  0:28
:END:
#+BEGIN_SRC scheme
    (define (for-each f l)
      (if (not (null? l))
          (begin (f (car l))
                 (for-each f (cdr l)))))
#+END_SRC
Note that "nil" is no longer a part of the Scheme standard. See this
[[https://stackoverflow.com/questions/9115703/null-value-in-mit-scheme][stackoverflow post]] for more.
** Exercise 2.25
#+BEGIN_SRC scheme
  (define l1 (list 1 3 (list 5 7) 9))
  (car (cdr (car (cdr (cdr l1)))))
  (define l2 (list (list 7)))
  (car (car l2))
  (define l3 (list 1 (list 2 (list 3 (list 4 (list 5 (list 6 7)))))))
  (car (cdr (car (cdr (car (cdr (car (cdr (car (cdr (car (cdr l3))))))))))))
#+END_SRC
** Exercise 2.27
#+BEGIN_SRC scheme
  (define (deep-reverse l)
    (define (helper in out)
      (if (null? in)
          out
          (helper (cdr in) (cons (deep-reverse (car in)) out))))
    (if (list? l)
        (helper l ())
        l))
#+END_SRC
** Exercise 2.28
#+BEGIN_SRC scheme
  (define (fringe tree)
    (cond ((not (list? tree)) (list tree))
          ((not (pair? tree)) tree)
          (else (append (fringe (car tree)) (fringe (cdr tree))))))
#+END_SRC
** Exercise 2.29
#+BEGIN_SRC scheme
  (define (left-branch m) (car m))
  (define (right-branch m) (car (cdr m)))
  (define (branch-length b) (car b))
  (define (branch-structure b) (car (cdr b)))
  (define (mobile? structure) (pair? structure))
  (define (branch-weight b)
    (let ((structure (branch-structure b)))
      (if (mobile? structure)
          (total-weight structure)
          structure)))   
  (define (total-weight m)
    (+ (branch-weight (left-branch m))
       (branch-weight (right-branch m))))
  (define (mobile-balanced? m)
    (define (branch-balanced? b)
      (let ((structure (branch-structure b)))
        (if (mobile? structure)
            (mobile-balanced? structure)
            #t)))
    (let ((left (left-branch m))
          (right (right-branch m)))
      (and (= (* (branch-length left) (branch-weight left))
              (* (branch-length right) (branch-weight right)))
           (branch-balanced? left)
           (branch-balanced? right))))
#+END_SRC
** Exercise 2.30
#+BEGIN_SRC scheme
  (define (square-tree tree)
    (cond ((null? tree) tree)
          ((not (pair? tree)) (square tree))
          (else (cons (square-tree (car tree))
                      (square-tree (cdr tree))))))
  (define (square-tree-map tree)
    (map (lambda (subtree)
           (if (not (pair? subtree))
               (square subtree)
               (square-tree-map subtree)))
         tree))
#+END_SRC
** Exercise 2.31
#+BEGIN_SRC scheme
  (define (tree-map f t)
    (cond ((null? t) t)
          ((not (pair? t)) (f t))
          (else (cons (tree-map f (car t))
                      (tree-map f (cdr t))))))
#+END_SRC
** Exercise 2.32
The procedure takes advantage of the following observation. If $x$ is
an element of set $S$ then we can partition the subsets of $S$ into
two categories: those that contain $x$ and those that do not. All of
the subsets that do not contain $x$ can be found by recursively
finding all of the subsets of $S \setminus {x}$. All of the subsets
that do contain $x$ are of the form $x \cup U$ where $U \in \wp (S
\setminus {x})$.
#+BEGIN_SRC scheme
  (define (subsets s)
    (if (null? s)
        (list ())
        (let ((rest (subsets (cdr s))))
          (append rest (map (lambda (l) (cons (car s) l)) rest)))))
#+END_SRC
** Exercise 2.33
#+BEGIN_SRC scheme
  (define (accumulate op initial sequence)
    (if (null? sequence)
        initial
        (op (car sequence)
            (accumulate op initial (cdr sequence)))))
  (define (map p sequence)
    (accumulate (lambda (x y) (cons (p x) y)) () sequence))
  (define (append seq1 seq2)
    (accumulate cons seq2 seq1))
  (define (length sequence)
    (accumulate (lambda (x y) (+ 1 y)) 0 sequence))
#+END_SRC
** Exercise 2.34
#+BEGIN_SRC scheme
  (define (horner-eval x coefficient-sequence)
    (accumulate (lambda (this-coeff higher-terms)
                  (+ (* higher-terms x)
                     this-coeff))
                0
                coefficient-sequence))
#+END_SRC
** Exercise 2.35
#+BEGIN_SRC scheme
  (define (count-leaves t)
    (accumulate +
                0
                (map (lambda (elt)
                       (if (pair? elt)
                           (count-leaves elt)
                           1))
                     t)))
#+END_SRC
