sicp-exercises.html
<div id="outline-container-org6435c9a" class="outline-3">
<h3 id="org6435c9a">Exercise 2.21</h3>
<div class="outline-text-3" id="text-org6435c9a">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">square-list</span> items)
  (<span style="color: #a020f0;">if</span> (null? items)
      items
      (cons (square (car items))
            (square-list (cdr items)))))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">square-list-map</span> items)
  (<span style="color: #a020f0;">map</span> square items))
</pre>
</div>
</div>
</div>
<div id="outline-container-org246e081" class="outline-3">
<h3 id="org246e081">Exercise 2.22</h3>
<div class="outline-text-3" id="text-org246e081">
<p>
Elements appearing first in the input list will be added to the head
of the ouput list before elements appearing later. Therefore, elements
appearing first in the input will appear later in the output.
</p>

<p>
Now, the output isn't a list.
</p>
</div>
</div>
<div id="outline-container-org928904e" class="outline-3">
<h3 id="org928904e">Exercise 2.23</h3>
<div class="outline-text-3" id="text-org928904e">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">for-each</span> f l)
  (<span style="color: #a020f0;">if</span> (not (null? l))
      (<span style="color: #a020f0;">begin</span> (f (car l))
             (<span style="color: #a020f0;">for-each</span> f (cdr l)))))
</pre>
</div>
<p>
Note that "nil" is no longer a part of the Scheme standard. See this
<a href="https://stackoverflow.com/questions/9115703/null-value-in-mit-scheme">stackoverflow post</a> for more.
</p>
</div>
</div>
<div id="outline-container-org1c9dbfd" class="outline-3">
<h3 id="org1c9dbfd">Exercise 2.25</h3>
<div class="outline-text-3" id="text-org1c9dbfd">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">l1</span> (list 1 3 (list 5 7) 9))
(car (cdr (car (cdr (cdr l1)))))
(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">l2</span> (list (list 7)))
(car (car l2))
(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">l3</span> (list 1 (list 2 (list 3 (list 4 (list 5 (list 6 7)))))))
(car (cdr (car (cdr (car (cdr (car (cdr (car (cdr (car (cdr l3))))))))))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org1e5ce85" class="outline-3">
<h3 id="org1e5ce85">Exercise 2.27</h3>
<div class="outline-text-3" id="text-org1e5ce85">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">deep-reverse</span> l)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">helper</span> in out)
    (<span style="color: #a020f0;">if</span> (null? in)
        out
        (helper (cdr in) (cons (deep-reverse (car in)) out))))
  (<span style="color: #a020f0;">if</span> (list? l)
      (helper l ())
      l))
</pre>
</div>
</div>
</div>
<div id="outline-container-org67e83d8" class="outline-3">
<h3 id="org67e83d8">Exercise 2.28</h3>
<div class="outline-text-3" id="text-org67e83d8">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">fringe</span> tree)
  (<span style="color: #a020f0;">cond</span> ((not (list? tree)) (list tree))
        ((not (pair? tree)) tree)
        (<span style="color: #a020f0;">else</span> (append (fringe (car tree)) (fringe (cdr tree))))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org15db373" class="outline-3">
<h3 id="org15db373">Exercise 2.29</h3>
<div class="outline-text-3" id="text-org15db373">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">left-branch</span> m) (car m))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">right-branch</span> m) (car (cdr m)))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">branch-length</span> b) (car b))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">branch-structure</span> b) (car (cdr b)))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">mobile?</span> structure) (pair? structure))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">branch-weight</span> b)
  (<span style="color: #a020f0;">let</span> ((structure (branch-structure b)))
    (<span style="color: #a020f0;">if</span> (mobile? structure)
        (total-weight structure)
        structure)))   
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">total-weight</span> m)
  (+ (branch-weight (left-branch m))
     (branch-weight (right-branch m))))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">mobile-balanced?</span> m)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">branch-balanced?</span> b)
    (<span style="color: #a020f0;">let</span> ((structure (branch-structure b)))
      (<span style="color: #a020f0;">if</span> (mobile? structure)
          (mobile-balanced? structure)
          #t)))
  (<span style="color: #a020f0;">let</span> ((left (left-branch m))
        (right (right-branch m)))
    (<span style="color: #a020f0;">and</span> (= (* (branch-length left) (branch-weight left))
            (* (branch-length right) (branch-weight right)))
         (branch-balanced? left)
         (branch-balanced? right))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgab3c0dd" class="outline-3">
<h3 id="orgab3c0dd">Exercise 2.30</h3>
<div class="outline-text-3" id="text-orgab3c0dd">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">square-tree</span> tree)
  (<span style="color: #a020f0;">cond</span> ((null? tree) tree)
        ((not (pair? tree)) (square tree))
        (<span style="color: #a020f0;">else</span> (cons (square-tree (car tree))
                    (square-tree (cdr tree))))))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">square-tree-map</span> tree)
  (<span style="color: #a020f0;">map</span> (<span style="color: #a020f0;">lambda</span> (subtree)
         (<span style="color: #a020f0;">if</span> (not (pair? subtree))
             (square subtree)
             (square-tree-map subtree)))
       tree))
</pre>
</div>
</div>
</div>
<div id="outline-container-org726b9fc" class="outline-3">
<h3 id="org726b9fc">Exercise 2.31</h3>
<div class="outline-text-3" id="text-org726b9fc">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">tree-map</span> f t)
  (<span style="color: #a020f0;">cond</span> ((null? t) t)
        ((not (pair? t)) (f t))
        (<span style="color: #a020f0;">else</span> (cons (tree-map f (car t))
                    (tree-map f (cdr t))))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb56f17a" class="outline-3">
<h3 id="orgb56f17a">Exercise 2.32</h3>
<div class="outline-text-3" id="text-orgb56f17a">
<p>
The procedure takes advantage of the following observation. If \(x\) is
an element of set \(S\) then we can partition the subsets of \(S\) into
two categories: those that contain \(x\) and those that do not. All of
the subsets that do not contain \(x\) can be found by recursively
finding all of the subsets of \(S \setminus {x}\). All of the subsets
that do contain \(x\) are of the form \(x \cup U\) where \(U \in \wp (S
\setminus {x})\).
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">subsets</span> s)
  (<span style="color: #a020f0;">if</span> (null? s)
      (list ())
      (<span style="color: #a020f0;">let</span> ((rest (subsets (cdr s))))
        (append rest (<span style="color: #a020f0;">map</span> (<span style="color: #a020f0;">lambda</span> (l) (cons (car s) l)) rest)))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf12b6a6" class="outline-3">
<h3 id="orgf12b6a6">Exercise 2.33</h3>
<div class="outline-text-3" id="text-orgf12b6a6">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">accumulate</span> op initial sequence)
  (<span style="color: #a020f0;">if</span> (null? sequence)
      initial
      (op (car sequence)
          (accumulate op initial (cdr sequence)))))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">map</span> p sequence)
  (accumulate (<span style="color: #a020f0;">lambda</span> (x y) (cons (p x) y)) () sequence))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">append</span> seq1 seq2)
  (accumulate cons seq2 seq1))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">length</span> sequence)
  (accumulate (<span style="color: #a020f0;">lambda</span> (x y) (+ 1 y)) 0 sequence))
</pre>
</div>
</div>
</div>
<div id="outline-container-org43a284d" class="outline-3">
<h3 id="org43a284d">Exercise 2.34</h3>
<div class="outline-text-3" id="text-org43a284d">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">horner-eval</span> x coefficient-sequence)
  (accumulate (<span style="color: #a020f0;">lambda</span> (this-coeff higher-terms)
                (+ (* higher-terms x)
                   this-coeff))
              0
              coefficient-sequence))
</pre>
</div>
</div>
</div>
<div id="outline-container-org8f55622" class="outline-3">
<h3 id="org8f55622">Exercise 2.35</h3>
<div class="outline-text-3" id="text-org8f55622">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">count-leaves</span> t)
  (accumulate +
              0
              (<span style="color: #a020f0;">map</span> (<span style="color: #a020f0;">lambda</span> (elt)
                     (<span style="color: #a020f0;">if</span> (pair? elt)
                         (count-leaves elt)
                         1))
                   t)))
</pre>
</div>
</div>
</div>
