org/sicp-exercises.org
** Exercise 2.36
#+BEGIN_SRC scheme
  (define (accumulate-n op init seqs)
    (if (null? (car seqs))
        ()
        (cons (accumulate op init (map car seqs))
              (accumulate-n op init (map cdr seqs)))))
#+END_SRC
** Exercise 2.37
#+BEGIN_SRC scheme
  (define (dot-product v w)
    (accumulate + 0 (map * v w)))
  (define (matrix-*-vector m v)
    (map (lambda (row)
           (dot-product row v))
         m))
  (define (transpose mat)
    (accumulate-n cons () mat))
  (define (matrix-*-matrix m n)
    (let ((cols (transpose n)))
      (map (lambda (row)
             (map (lambda (col)
                    (dot-product row col))
                  cols))
           m)))
#+END_SRC
** Exercise 2.38
#+BEGIN_SRC scheme
  (define (fold-left op initial sequence)
    (define (iter result rest)
      (if (null? rest)
          result
          (iter (op result (car rest))
                (cdr rest))))
    (iter initial sequence))
  (define fold-right accumulate)

  (fold-right / 1 (list 1 2 3)) ; 3/2
  (fold-left / 1 (list 1 2 3)) ; 1/6
  (fold-right list () (list 1 2 3)) ; (1 (2 (3 ())))
  (fold-left list () (list 1 2 3)) ; (((() 1) 2) 3)
#+END_SRC
** Exercise 2.39
#+BEGIN_SRC scheme
  (define (reverse sequence)
    (fold-right (lambda (x y) (append y (list x))) () sequence))
  (define (reverse sequence)
    (fold-left (lambda (x y) (cons y x)) () sequence))
#+END_SRC
** Exercise 2.40
#+BEGIN_SRC scheme
  (define (enumerate-interval k)
    (define (iter curr result)
      (if (= curr 0)
          result
          (iter (- curr 1) (cons curr result))))
    (iter k ()))
  (define (unique-pairs n)
    (flatmap (lambda (i)
               (map (lambda (j)
                      (list i j))
                    (enumerate-interval (- i 1))))
             (enumerate-interval n)))
#+END_SRC
** Exercise 2.41
#+BEGIN_SRC scheme
  ;; This is slow...
  (define (unique-tuples n max)
    (cond ((= n 0) (list ()))
          ((< max n) ())
          ((= max n) (list (reverse (enumerate-interval n))))
          (else (append (unique-tuples n (- max 1))
                        (map (lambda (t)
                               (cons max t))
                             (unique-tuples (- n 1) (- max 1)))))))
  ;; (define (unique-tuples n max)
  ;;   (define (iter tuples)
  ;;     (if (= (length (car tuples)) 0)
  ;;         tuples
  ;;         (iter (flatmap (lambda (l)
  ;;                          (if))))))
  ;;   (if (< max n)
  ;;       ()
  ;;       (flatmap values
  ;;                (iter (map list
  ;;                           (reverse (enumerate-interval n)))))))
  ;; ;; And this doesn't work...
  ;; (define (unique-tuples n max)
  ;;   (define (next-tuple tuple)
  ;;     (define (cons-next-tuple min t)
  ;;       (cond ((null? t) t)
  ;;             ((null? (cdr t)) t)
  ;;             ((= (car t) (- (cadr t) 1))
  ;;              (cons min (cons-next-tuple (+ min 1) (cdr t))))
  ;;             (else (cons (+ 1 (car t)) (cdr t)))))
  ;;     (cons-next-tuple 1 tuple))
  ;;   (define (iter t result)
  ;;     (if (> (car t) max)
  ;;         result
  ;;         (iter (next-tuple t) (cons t result))))
  ;;   (iter (enumerate-interval n) ()))
  (define (sum-list l)
    (fold-left + 0 l))
  (define (bounded-partition n parts bound)
    (filter (lambda (t)
              (= n (sum-list t)))
            (unique-tuples parts bound)))
  (define (bounded-paritition-3 total bound)
    (bounded-partition total 3 bound))
#+END_SRC
