sicp-exercises.html
<div id="outline-container-orgf2c405e" class="outline-3">
<h3 id="orgf2c405e">Exercise 2.36</h3>
<div class="outline-text-3" id="text-orgf2c405e">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">accumulate-n</span> op init seqs)
  (<span style="color: #a020f0;">if</span> (null? (car seqs))
      ()
      (cons (accumulate op init (<span style="color: #a020f0;">map</span> car seqs))
            (accumulate-n op init (<span style="color: #a020f0;">map</span> cdr seqs)))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org2cbd7e8" class="outline-3">
<h3 id="org2cbd7e8">Exercise 2.37</h3>
<div class="outline-text-3" id="text-org2cbd7e8">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">dot-product</span> v w)
  (accumulate + 0 (<span style="color: #a020f0;">map</span> * v w)))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">matrix-*-vector</span> m v)
  (<span style="color: #a020f0;">map</span> (<span style="color: #a020f0;">lambda</span> (row)
         (dot-product row v))
       m))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">transpose</span> mat)
  (accumulate-n cons () mat))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">matrix-*-matrix</span> m n)
  (<span style="color: #a020f0;">let</span> ((cols (transpose n)))
    (<span style="color: #a020f0;">map</span> (<span style="color: #a020f0;">lambda</span> (row)
           (<span style="color: #a020f0;">map</span> (<span style="color: #a020f0;">lambda</span> (col)
                  (dot-product row col))
                cols))
         m)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org81ac7f3" class="outline-3">
<h3 id="org81ac7f3">Exercise 2.38</h3>
<div class="outline-text-3" id="text-org81ac7f3">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">fold-left</span> op initial sequence)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">iter</span> result rest)
    (<span style="color: #a020f0;">if</span> (null? rest)
        result
        (iter (op result (car rest))
              (cdr rest))))
  (iter initial sequence))
(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">fold-right</span> accumulate)

(fold-right / 1 (list 1 2 3)) <span style="color: #b22222;">; </span><span style="color: #b22222;">3/2</span>
(fold-left / 1 (list 1 2 3)) <span style="color: #b22222;">; </span><span style="color: #b22222;">1/6</span>
(fold-right list () (list 1 2 3)) <span style="color: #b22222;">; </span><span style="color: #b22222;">(1 (2 (3 ())))</span>
(fold-left list () (list 1 2 3)) <span style="color: #b22222;">; </span><span style="color: #b22222;">(((() 1) 2) 3)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1379a3c" class="outline-3">
<h3 id="org1379a3c">Exercise 2.39</h3>
<div class="outline-text-3" id="text-org1379a3c">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">reverse</span> sequence)
  (fold-right (<span style="color: #a020f0;">lambda</span> (x y) (append y (list x))) () sequence))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">reverse</span> sequence)
  (fold-left (<span style="color: #a020f0;">lambda</span> (x y) (cons y x)) () sequence))
</pre>
</div>
</div>
</div>
<div id="outline-container-orge26f44f" class="outline-3">
<h3 id="orge26f44f">Exercise 2.40</h3>
<div class="outline-text-3" id="text-orge26f44f">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">enumerate-interval</span> k)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">iter</span> curr result)
    (<span style="color: #a020f0;">if</span> (= curr 0)
        result
        (iter (- curr 1) (cons curr result))))
  (iter k ()))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">unique-pairs</span> n)
  (flatmap (<span style="color: #a020f0;">lambda</span> (i)
             (<span style="color: #a020f0;">map</span> (<span style="color: #a020f0;">lambda</span> (j)
                    (list i j))
                  (enumerate-interval (- i 1))))
           (enumerate-interval n)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf3c65f0" class="outline-3">
<h3 id="orgf3c65f0">Exercise 2.41</h3>
<div class="outline-text-3" id="text-orgf3c65f0">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #b22222;">;; </span><span style="color: #b22222;">This is slow...</span>
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">unique-tuples</span> n max)
  (<span style="color: #a020f0;">cond</span> ((= n 0) (list ()))
        ((&lt; max n) ())
        ((= max n) (list (reverse (enumerate-interval n))))
        (<span style="color: #a020f0;">else</span> (append (unique-tuples n (- max 1))
                      (<span style="color: #a020f0;">map</span> (<span style="color: #a020f0;">lambda</span> (t)
                             (cons max t))
                           (unique-tuples (- n 1) (- max 1)))))))
<span style="color: #b22222;">;; </span><span style="color: #b22222;">(define (unique-tuples n max)</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">(define (iter tuples)</span>
<span style="color: #b22222;">;;     </span><span style="color: #b22222;">(if (= (length (car tuples)) 0)</span>
<span style="color: #b22222;">;;         </span><span style="color: #b22222;">tuples</span>
<span style="color: #b22222;">;;         </span><span style="color: #b22222;">(iter (flatmap (lambda (l)</span>
<span style="color: #b22222;">;;                          </span><span style="color: #b22222;">(if))))))</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">(if (&lt; max n)</span>
<span style="color: #b22222;">;;       </span><span style="color: #b22222;">()</span>
<span style="color: #b22222;">;;       </span><span style="color: #b22222;">(flatmap values</span>
<span style="color: #b22222;">;;                </span><span style="color: #b22222;">(iter (map list</span>
<span style="color: #b22222;">;;                           </span><span style="color: #b22222;">(reverse (enumerate-interval n)))))))</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">;; And this doesn't work...</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">(define (unique-tuples n max)</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">(define (next-tuple tuple)</span>
<span style="color: #b22222;">;;     </span><span style="color: #b22222;">(define (cons-next-tuple min t)</span>
<span style="color: #b22222;">;;       </span><span style="color: #b22222;">(cond ((null? t) t)</span>
<span style="color: #b22222;">;;             </span><span style="color: #b22222;">((null? (cdr t)) t)</span>
<span style="color: #b22222;">;;             </span><span style="color: #b22222;">((= (car t) (- (cadr t) 1))</span>
<span style="color: #b22222;">;;              </span><span style="color: #b22222;">(cons min (cons-next-tuple (+ min 1) (cdr t))))</span>
<span style="color: #b22222;">;;             </span><span style="color: #b22222;">(else (cons (+ 1 (car t)) (cdr t)))))</span>
<span style="color: #b22222;">;;     </span><span style="color: #b22222;">(cons-next-tuple 1 tuple))</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">(define (iter t result)</span>
<span style="color: #b22222;">;;     </span><span style="color: #b22222;">(if (&gt; (car t) max)</span>
<span style="color: #b22222;">;;         </span><span style="color: #b22222;">result</span>
<span style="color: #b22222;">;;         </span><span style="color: #b22222;">(iter (next-tuple t) (cons t result))))</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">(iter (enumerate-interval n) ()))</span>
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">sum-list</span> l)
  (fold-left + 0 l))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">bounded-partition</span> n parts bound)
  (filter (<span style="color: #a020f0;">lambda</span> (t)
            (= n (sum-list t)))
          (unique-tuples parts bound)))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">bounded-paritition-3</span> total bound)
  (bounded-partition total 3 bound))
</pre>
</div>
</div>
</div>
