org/sicp-exercises.org
** Exercise 2.42
#+BEGIN_SRC scheme
    (define (make-queen row col)
      (list row col))
    (define (get-row queen)
      (car queen))
    (define (get-col queen)
      (cadr queen))
    (define (queens board-size)
      (define (adjoin-position row col board)
        (cons (make-queen row col) board))
      (define (safe? col board)
        (define (same-diag? q1 q2)
          (= (difference (get-row q1) (get-row q2))
             (difference (get-col q1) (get-col q2))))
        (define (same-row? q1 q2)
          (= (get-row q1) (get-row q2)))
        (let ((new-queen (car board)))
          (fold-right (lambda (x y) (and x y))
                      #t
                      (map (lambda (q)
                             (and (not (same-row? new-queen q))
                                  (not (same-diag? new-queen q))))
                           (cdr board)))))
      (define empty-board ())
      (define (queen-cols k)
        (if (= k 0)
            (list empty-board)
            (filter
             (lambda (positions) (safe? k positions))
             (flatmap
              (lambda (rest-of-queens)
                (map (lambda (new-row)
                       (adjoin-position new-row k rest-of-queens))
                     (enumerate-interval board-size)))
              (queen-cols (- k 1))))))
      (queen-cols board-size))
    (define (repeat-display n str)
      (if (> n 0)
          (begin
            (display str)
            (whitespace (- n 1)))))
    (define (print-queens board)
      (define (iter left)
        (if (not (null? left))
            (let ((row (get-row (car left))))
              (repeat-display (- row 1) ".")
              (display "Q")
              (repeat-display (- (length board) row) ".")
              (newline)
              (iter (cdr left)))))
      (iter board))
    (define (show-queens n)
      (map (lambda (soln)
             (print-queens soln)
             (newline))
           (queens n)))
#+END_SRC
** Exercise 2.43
In the provided ~queens~ procedure, the $n \times (k-1)$ subproblem is
solved once. Then, for each solution of the subproblem, several
candidate solutions for the $n \times k$ problem are created by adding
a new column with a queen in each possible row.

Louis's procedure calculates each possible row once (in the call to
~enumerate-interval~). Then, for each row, the procedure calculates
the $n \times (k-1)$ subproblem. So, at each level of the process, the
subproblem is solved $n$ times. Therefore, in Louis' procedure, the
base-case $n \times 0$ problem, computed by ~(queens 0)~, is
calculated $n^{n}$ times. Louis' procedure solves the puzzle in
approximately time $n^{n}T$.
