sicp-exercises.html
<div id="outline-container-orge8fbb8f" class="outline-3">
<h3 id="orge8fbb8f">Exercise 2.42</h3>
<div class="outline-text-3" id="text-orge8fbb8f">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">make-queen</span> row col)
  (list row col))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">get-row</span> queen)
  (car queen))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">get-col</span> queen)
  (cadr queen))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">queens</span> board-size)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">adjoin-position</span> row col board)
    (cons (make-queen row col) board))
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">safe?</span> col board)
    (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">same-diag?</span> q1 q2)
      (= (difference (get-row q1) (get-row q2))
         (difference (get-col q1) (get-col q2))))
    (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">same-row?</span> q1 q2)
      (= (get-row q1) (get-row q2)))
    (<span style="color: #a020f0;">let</span> ((new-queen (car board)))
      (fold-right (<span style="color: #a020f0;">lambda</span> (x y) (<span style="color: #a020f0;">and</span> x y))
                  #t
                  (<span style="color: #a020f0;">map</span> (<span style="color: #a020f0;">lambda</span> (q)
                         (<span style="color: #a020f0;">and</span> (not (same-row? new-queen q))
                              (not (same-diag? new-queen q))))
                       (cdr board)))))
  (<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">empty-board</span> ())
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">queen-cols</span> k)
    (<span style="color: #a020f0;">if</span> (= k 0)
        (list empty-board)
        (filter
         (<span style="color: #a020f0;">lambda</span> (positions) (safe? k positions))
         (flatmap
          (<span style="color: #a020f0;">lambda</span> (rest-of-queens)
            (<span style="color: #a020f0;">map</span> (<span style="color: #a020f0;">lambda</span> (new-row)
                   (adjoin-position new-row k rest-of-queens))
                 (enumerate-interval board-size)))
          (queen-cols (- k 1))))))
  (queen-cols board-size))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">repeat-display</span> n str)
  (<span style="color: #a020f0;">if</span> (&gt; n 0)
      (<span style="color: #a020f0;">begin</span>
        (display str)
        (whitespace (- n 1)))))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">print-queens</span> board)
  (<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">iter</span> left)
    (<span style="color: #a020f0;">if</span> (not (null? left))
        (<span style="color: #a020f0;">let</span> ((row (get-row (car left))))
          (repeat-display (- row 1) <span style="color: #8b2252;">"."</span>)
          (display <span style="color: #8b2252;">"Q"</span>)
          (repeat-display (- (length board) row) <span style="color: #8b2252;">"."</span>)
          (newline)
          (iter (cdr left)))))
  (iter board))
(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">show-queens</span> n)
  (<span style="color: #a020f0;">map</span> (<span style="color: #a020f0;">lambda</span> (soln)
         (print-queens soln)
         (newline))
       (queens n)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org3fb842d" class="outline-3">
<h3 id="org3fb842d">Exercise 2.43</h3>
<div class="outline-text-3" id="text-org3fb842d">
<p>
In the provided <code>queens</code> procedure, the \(n \times (k-1)\) subproblem is
solved once. Then, for each solution of the subproblem, several
candidate solutions for the \(n \times k\) problem are created by adding
a new column with a queen in each possible row.
</p>

<p>
Louis's procedure calculates each possible row once (in the call to
<code>enumerate-interval</code>). Then, for each row, the procedure calculates
the \(n \times (k-1)\) subproblem. So, at each level of the process, the
subproblem is solved \(n\) times. Therefore, in Louis' procedure, the
base-case \(n \times 0\) problem, computed by <code>(queens 0)</code>, is
calculated \(n^{n}\) times. Louis' procedure solves the puzzle in
approximately time \(n^{n}T\).
</p>
</div>
</div>
</div>
</div>
</body>
</html>
